announcements/start-emacs-in-a-defun.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-16 Sun 12:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Start Emacs In A Defun</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Start Emacs In A Defun</h1>
<div id="outline-container-org260f03a" class="outline-2">
<h2 id="org260f03a"><span class="section-number-2">1</span> Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a follow-up to my earlier article titled <a href="https://emacspeak.blogspot.com/2017/08/emacs-start-up-speeding-it-up.html">Speeding Up Emacs
Startup</a> from August 2017. Three years later, I once again spent time
cleaning up and refactoring the results as described below. The
end-result is to once again speed up Emacs startup, while  making the
setup cleaner and easier to maintain than before.
</p>
</div>
</div>

<div id="outline-container-orgc67149e" class="outline-2">
<h2 id="orgc67149e"><span class="section-number-2">2</span> Start Emacs In A Defun</h2>
<div class="outline-text-2" id="text-2">
<p>
This <a href="https://github.com/tvraman/emacspeak/blob/master/tvr/emacs-startup.el#start-of-content">startup file</a> is set up with the following goals:
</p>

<ol class="org-ol">
<li>Speed up emacs startup &#x2014; setting environment variable
<a href="https://github.com/tvraman/emacspeak/blob/master/tvr/emacs-startup.el#L247-L311"><code>TVR_TIME_EMS</code></a> before starting emacs produces detailed timing
 information in the <b>Messages</b> buffer.</li>
<li>Customize packages via Custom  as far as possible.</li>
<li>Keep the  <a href="https://github.com/tvraman/emacspeak/blob/master/tvr/emacs-startup.el#L185-L311">custom settings</a>  in a separate file, with a later goal of
turning that into a  theme.</li>
<li>After converting to a theme, Move machine-specific custom settings
into a separate host-specific custom file, thus making the earlier
theme host-independent.  Place host-specific non-customizable bits
in default.el (not done yet).</li>
<li>Define package-specific settings not available via Custom in a package-specific &lt;package&gt;-prepare.el file.</li>
<li>Install everything from elpa/melpa as far as possible. (vm is an
exception at present) &#x2014; I have nearly 200 packages activated.</li>
<li>The startup file is a collection of functions with entry-point <a href="https://github.com/tvraman/emacspeak/blob/master/tvr/emacs-startup.el#L185-L311">tvr-emacs</a>.</li>
<li>The only top-level call is <a href="https://github.com/tvraman/emacspeak/blob/master/tvr/emacs-startup.el#L185-L311">(tvr-emacs)</a>.</li>
<li>Function tvr-emacs starts up Emacspeak, and sets up two hooks:
<ul class="org-ul">
<li>after-init-hook to do the bulk of the work.</li>
<li>emacs-startup-hook to set up  initial window configuration.</li>
</ul></li>
<li>Function <a href="https://github.com/tvraman/emacspeak/blob/master/tvr/emacs-startup.el#L185-L311">tvr-after-init-hook</a> on after-init-hook does the following:
<ul class="org-ul">
<li>Load package-specific prepare.el files.</li>
<li>Load the custom settings file.</li>
<li>Starts up things like the emacs server.</li>
<li>Some of these tasks are done on a separate thread using make-thread.</li>
</ul></li>
<li>The work of loading files etc., is done within macro <a href="https://github.com/tvraman/emacspeak/blob/master/tvr/emacs-startup.el#L185-L311">tvr-fastload</a></li>
</ol>
<p>
which sets up an efficient environment for loading files.
</p>
</div>
</div>

<div id="outline-container-orgeabc340" class="outline-2">
<h2 id="orgeabc340"><span class="section-number-2">3</span> Conclusion</h2>
<div class="outline-text-2" id="text-3">
<p>
With this setup, <code>M-x emacs-init-time</code> shows  init-time as
</p>
<pre class="example">
1.288381225 seconds
</pre>

<p>
on my laptop with an SSD.  Setting <code>package-quickstart</code> to <code>T</code> is a
major win when running with a spinning-disk instead of an SSD. But the
biggest win is that I no longer have to go hunting to find out where
something in emacs got configured a given way &#x2014; AKA, there are a
limited number of places I need to look.
</p>
</div>
</div>

<div id="outline-container-orgdfca393" class="outline-2">
<h2 id="orgdfca393"><span class="section-number-2">4</span> Wish-List</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Remembering  the name of a custom-setting  you set up a while ago
is still  a challenge, You cant find it unless you remember its
approximate name.</li>
<li>Command <code>emacspeak-wizards-customize-saved</code> bound to <code>C-h C-s</code>
helps some in this regard but is a stop-gap solution.</li>
<li>Custom themes are  not  easy to use.</li>
<li>I keep my <code>custom-file</code> checked into a local Git repository and
is the only part of my setup that I cannot publish &#x2014; since that
file tends to hoover up information that you shouldn't publish,
e.g., aPI keys and other private/personal bits.</li>
<li>Perhaps Emacs needs at least two custom-files, a public and a
private custom-file.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-08-16 Sun 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2020-08-16 Sun 12:11</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
